Revit 2027 API
IFCPropertyMappingInfo.RevitPropertyName Property
 The Revit property name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RevitPropertyName { get; set; }
Public Property RevitPropertyName As String
	Get
	Set
public:
property String^ RevitPropertyName {
	String^ get ();
	void set (String^ value);
}
member RevitPropertyName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCPropertyMappingInfo Class
Autodesk.Revit.DB Namespace